Repository: wilx/lzwenc
Catalog: lzwenc/src/main/resources/lzwenc/*.po
Languages: cs

source: LZW encoding
cs: LZW komprese

source: initialize dictionary
cs: inicializace slovníku

source: current_node = root
cs: současný_uzel = kořen

source: while not eof(input) do begin
cs: while not eof(vstup) do begin

source: letter = getchar(input)
cs: písmeno = getchar(vstup)

source: next_node = current_node.edges[letter]
cs: další_uzel = současný_uzel.hrany[písmeno]

source: if can't go further from current_node then begin
cs: if nelze jít ze současného_uzlu dále then begin

source: output = current_node.number
cs: výstup = současný_uzel.číslo

source: insert new edge through input letter from current_node with number = node_count
cs: vlož nový přechod ze současného_uzlu přes písmeno do nového uzlu s číslem = počet_uzlů

source: increment node_count
cs: inkremenetuj počet_uzlů

source: current_node = move from root to next node through input letter
cs: současný_uzel = kořen.hrany[vstupní písmeno]

source: current_node = next_node
cs: současný_uzel = další_uzel

source: Input:
cs: Vstup:

source: Output:
cs: Výstup:

source: Compression ration:
cs: Kompresní poměr:
